OPENFOAM/parallelPlates/nu_10_3/v_2/parallel_plate_B/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0;
    }


    pFinal
    {
        $p;
        relTol          0;
    }

    UFinal
    {
        $U;
        relTol 0;
    }
    
    
}

PIMPLE
{
    momentumPredictor on;
    nCorrectors        1;
    nOuterCorrectors  50;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
    
    residualControl
    {
      U
      {
        tolerance 1e-04;
        relTol        0;
      }
      p
      {
        tolerance 1e-04;
        relTol        0;
      }
    }
    
}

relaxationFactors
{
    fields
    {
        p 0.3;
    }

    equations
    {
        U 0.7;
    }

}

// ************************************************************************* //
